app/controllers/resturants_controller.rb

  def update
    if @resturant.update_attributes(resturant_params)
---
UPDATE "resturants" SET "name" = $1, "user_id" = $2, "updated_at" = $3 WHERE "resturants"."id" = $4  [["name", "italian22"], ["user_id", 1], ["updated_at", "2018-08-16 09:05:07.528418"], ["id", 1]]

  def create
    if @resturant.save
---
INSERT INTO "resturants" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "italian-pizza"], ["user_id", 1], ["created_at", "2018-08-16 14:39:53.706496"], ["updated_at", "2018-08-16 14:39:53.706496"]]