app/controllers/reviews_controller.rb

  def create
    if @review.save
---
INSERT INTO "reviews" ("review", "stars", "user_id", "resturant_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["review", "sasdasd"], ["stars", 2], ["user_id", 2], ["resturant_id", 1], ["created_at", "2018-08-16 15:55:04.189909"], ["updated_at", "2018-08-16 15:55:04.189909"]]

  def destroy
    if @review.destroy
---
DELETE FROM "reviews" WHERE "reviews"."id" = $1  [["id", 1]]

  def update
    if @review.update_attributes(review_params)
---
UPDATE "reviews" SET "stars" = $1, "updated_at" = $2 WHERE "reviews"."id" = $3  [["stars", 4], ["updated_at", "2018-08-16 16:31:58.511029"], ["id", 2]]